---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayEllipseRadiusX
source: html/502a1a18-b282-ca79-a25f-9e87d5e2b556.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayEllipseRadiusX Property

The property labeled "Radius (cm) along the longer axis of ray ellipse" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodRayEllipseRadiusX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".